//============================================
//
// 背景のメイン処理[bg.cpp]
// Author：小原立暉
//
//============================================
//********************************************
// インクルードファイル
//********************************************
#include "bg.h"
#include "manager.h"
#include "renderer.h"
#include "texture.h"

//--------------------------------------------
// マクロ定義
//--------------------------------------------
#define BG_TEXTURE		"data/TEXTURE/SkyBox.jpg"	// 背景のテクスチャ

//===========================================
// コンストラクタ
//===========================================
CBg::CBg() : CObject3D(CObject::TYPE_BG, CObject::PRIORITY_BG)
{

}

//===========================================
// デストラクタ
//===========================================
CBg::~CBg()
{

}

//===========================================
// 初期化処理
//===========================================
HRESULT CBg::Init(void)
{
	if (FAILED(CObject3D::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// スクロールの設定処理
	SetPos(D3DXVECTOR3(0.0f, 0.0f, 2000.0f));	// 位置設定
	SetRot(D3DXVECTOR3(0.0f, 0.0f, 0.0f));		// 向き設定
	SetSize(D3DXVECTOR3(20000.0f, 20000.0f, 0.0f));	// サイズ設定

	// 頂点情報の設定処理
	SetVertex();

	// 全ての値を初期化する
	BindTexture(CManager::GetTexture()->Regist(BG_TEXTURE));			// テクスチャの読み込み

	// 成功を返す
	return S_OK;
}

//===========================================
// 終了処理
//===========================================
void CBg::Uninit(void)
{
	// 終了
	CObject3D::Uninit();
}

//===========================================
// 更新処理
//===========================================
void CBg::Update(void)
{
	// 更新
	CObject3D::Update();
}

//===========================================
// 描画処理
//===========================================
void CBg::Draw(void)
{
	// 描画処理
	CObject3D::DrawLightOff();
}

//===========================================
// 生成処理
//===========================================
CBg* CBg::Create(void)
{
	// ローカルオブジェクトを生成
	CBg* pBg = nullptr;			// プレイヤーのインスタンスを生成

	if (pBg == nullptr)
	{ // オブジェクトが NULL の場合

		// オブジェクトを生成
		pBg = new CBg;
	}
	else
	{ // オブジェクトが NULL じゃない場合

		// NULL を返す
		return nullptr;
	}

	if (pBg != nullptr)
	{ // オブジェクトが NULL じゃない場合

		// 初期化処理
		if (FAILED(pBg->Init()))
		{ // 背景の初期化に失敗した場合

			// 警告文
			MessageBox(NULL, "背景の初期化に失敗！", "警告！", MB_ICONWARNING);

			// NULL を返す
			return nullptr;
		}
	}
	else
	{ // オブジェクトが NULL の場合

		// NULL を返す
		return nullptr;
	}

	// オブジェクト2Dのポインタを返す
	return pBg;
}