//===========================================
//
// 地面ブロックのメイン処理[dirtblock.cpp]
// Author 小原立暉
//
//===========================================
//*******************************************
// インクルードファイル
//*******************************************
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "dirtblock.h"

//==============================
// コンストラクタ
//==============================
CDirtBlock::CDirtBlock() : CBlock(CObject::TYPE_BLOCK, CObject::PRIORITY_BLOCK)
{

}

//==============================
// デストラクタ
//==============================
CDirtBlock::~CDirtBlock()
{

}

//==============================
//ブロックの初期化処理
//==============================
HRESULT CDirtBlock::Init(void)
{
	// ファイルの設定処理
	SetFileData(CXFile::TYPE_BLOCK_DIRT);

	if (FAILED(CBlock::Init()))
	{ // 初期化処理に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// 値を返す
	return S_OK;
}

//========================================
//ブロックの終了処理
//========================================
void CDirtBlock::Uninit(void)
{
	// 終了処理
	CBlock::Uninit();
}

//========================================
//ブロックの更新処理
//========================================
void CDirtBlock::Update(void)
{
	// 更新処理
	CBlock::Update();
}

//=====================================
//ブロックの描画処理
//=====================================
void CDirtBlock::Draw(void)
{
	// 描画処理
	CBlock::Draw();
}