//===========================================
//
// 氷ブロックのメイン処理[iceblock.cpp]
// Author 小原立暉
//
//===========================================
//*******************************************
// インクルードファイル
//*******************************************
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "iceblock.h"

//==============================
// コンストラクタ
//==============================
CIceBlock::CIceBlock() : CBlock(CObject::TYPE_BLOCK, CObject::PRIORITY_BLOCK)
{

}

//==============================
// デストラクタ
//==============================
CIceBlock::~CIceBlock()
{

}

//==============================
//ブロックの初期化処理
//==============================
HRESULT CIceBlock::Init(void)
{
	// ファイルの設定処理
	SetFileData(CXFile::TYPE_BLOCK_ICE);

	if (FAILED(CBlock::Init()))
	{ // 初期化処理に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// 値を返す
	return S_OK;
}

//========================================
//ブロックの終了処理
//========================================
void CIceBlock::Uninit(void)
{
	// 終了処理
	CBlock::Uninit();
}

//========================================
//ブロックの更新処理
//========================================
void CIceBlock::Update(void)
{
	// 更新処理
	CBlock::Update();
}

//=====================================
//ブロックの描画処理
//=====================================
void CIceBlock::Draw(void)
{
	// 描画処理
	CBlock::Draw();
}