//=======================================
//
// チュートリアルのゴールのメイン処理[tutorial_goal.cpp]
// Author：小原立暉
//
//=======================================
#include "tutorial_goal.h"
#include "collision.h"
#include "tutorial.h"

//---------------------------------------
// マクロ定義
//---------------------------------------

//==========================================
// コンストラクタ
//==========================================
CTutorialGoal::CTutorialGoal() : CGoal(CObject::TYPE_GOAL, CObject::PRIORITY_PLAYER)
{

}

//==========================================
// デストラクタ
//==========================================
CTutorialGoal::~CTutorialGoal()
{

}

//==========================================
// ゴールの初期化処理
//==========================================
HRESULT CTutorialGoal::Init(void)
{
	if (FAILED(CGoal::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// 成功を返す
	return S_OK;
}

//========================================
// ゴールの終了処理
//========================================
void CTutorialGoal::Uninit(void)
{
	// 終了処理
	CGoal::Uninit();
}

//========================================
// ゴールの更新処理
//========================================
void CTutorialGoal::Update(void)
{
	// 透明度の変化
	AlphaChange();

	// ゴールとプレイヤーの当たり判定
	if (collision::GoalPlayerCollision(this) == true)
	{ // 当たり判定が true だった場合

		// チュートリアルを終了させる
		CTutorial::SetState(CTutorial::STATE_END);

		// 終了処理
		Uninit();

		// この先の処理を行わない
		return;
	}
}

//===========================================
// ゴールの描画処理
//===========================================
void CTutorialGoal::Draw(void)
{
	// 描画処理
	CGoal::Draw();
}